Repository: bobur22/global-tuitUZ
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Yusufov Otabek proudly receives his 2nd place certificate for the CanSat Uzbekistan 2025 competition. His dedication and skill in microsatellite development are a testament ...
ru: Юсуфов Отабек с гордостью получает сертификат за 2-е место в соревновании CanSat Узбекистан 2025. Его преданность и мастерство в разработке микроспутников являются свидетельством ...
uz: Yusufov Otabek CanSat O‘zbekiston 2025 tanlovida 2-o‘rin sertifikatini faxr bilan qabul qilmoqda. Uning mikrosun'iy yo‘ldoshlarni ishlab chiqishdagi fidoyiligi va mahorati bunga dalildir ...

source: Lead, Connect, Impact
ru: Лидируйте, объединяйтесь, воздействуйте
uz: Yetakchilik qiling, bog‘laning, ta'sir qiling

source: Explore how you can stay engaged with the Falco community and contribute to a global mission.
ru: Узнайте, как вы можете оставаться вовлеченными в сообщество Falco и вносить вклад в глобальную миссию.
uz: Falco jamoasi bilan qanday faol ishtirok etish va global missiyaga hissa qo‘shish mumkinligini kashf eting.

source: Mentor the Next Wave
ru: Наставляйте новое поколение
uz: Keyingi to‘lqin uchun murabbiy bo‘ling

source: Share your knowledge, guide rising talent, and shape future leaders from TUIT and beyond.
ru: Делитесь своими знаниями, направляйте молодые таланты и формируйте будущих лидеров из ТУИТ и за его пределами.
uz: Bilimingizni baham ko‘ring, yosh iste’dodlarni yo‘l-yo‘riq ko‘rsating va TUIT va undan tashqarida kelajak yetakchilarini shakllantiring.

source: Become a Mentor
ru: Станьте наставником
uz: Murabbiy bo‘ling

source: Global Gatherings
ru: Глобальные встречи
uz: Global yig‘inlar

source: Reconnect, network, and collaborate with fellow changemakers through exclusive Falco and TUIT events.
ru: Воссоединяйтесь, налаживайте связи и сотрудничайте с единомышленниками на эксклюзивных мероприятиях Falco и ТУИТ.
uz: Eksklyuziv Falco va TUIT tadbirlari orqali boshqa o‘zgarishlar keltiruvchilar bilan qayta bog‘laning, tarmoq quring va hamkorlik qiling.

source: Upcoming Events
ru: Предстоящие мероприятия
uz: Yaqinlashib kelayotgan tadbirlar

source: Fuel the Mission
ru: Поддержите миссию
uz: Missiyani qo‘llab-quvvatlang

source: Contribute time, resources, or expertise to accelerate high-impact projects and student-led initiatives.
ru: Внесите свой вклад временем, ресурсами или экспертизой, чтобы ускорить проекты с высоким влиянием и инициативы, возглавляемые студентами.
uz: Yuqori ta'sirli loyihalar va talabalar tashabbuskorligidagi loyihalarni tezlashtirish uchun vaqt, resurslar yoki tajriba bilan hissa qo‘shing.

source: Support Our Mission
ru: Поддержите нашу миссию
uz: Missiyamizni qo‘llab-quvvatlang

source: Career & Opportunity Hub
ru: Центр карьеры и возможностей
uz: Karyera va imkoniyatlar markazi

source: Access a global network of innovators, employers, and mission-driven professionals through Falco.
ru: Получите доступ к глобальной сети новаторов, работодателей и профессионалов, ориентированных на миссию, через Falco.
uz: Falco orqali innovatorlar, ish beruvchilar va missiyaga yo‘naltirilgan mutaxassislarning global tarmog‘iga kiring.

source: Join Network
ru: Присоединиться к сети
uz: Tarmoqqa qo‘shiling

source: Our Address
ru: Наш адрес
uz: Bizning manzilimiz

source: Tashkent 100084, Amir Temur avenue 108, Uzbekistan
ru: Ташкент 100084, проспект Амира Темура 108, Узбекистан
uz: Toshkent 100084, Amir Temur shohko‘chasi 108, O‘zbekiston

source: Email Address
ru: Адрес электронной почты
uz: Elektron pochta manzili

source: Contact by Phone
ru: Связаться по телефону
uz: Telefon orqali bog‘laning

source: Get in Touch
ru: Связаться с нами
uz: Bog‘lanish

source: Full Name
ru: Полное имя
uz: To‘liq ism

source: Subject
ru: Тема
uz: Mavzu

source: Write Message...
ru: Напишите сообщение...
uz: Xabaringizni yozing...

source: SEND MESSAGE
ru: ОТПРАВИТЬ СООБЩЕНИЕ
uz: XABAR YUBORISH

source: Shaping ICT Innovators Through Education
ru: Формирование ИКТ-новаторов через образование
uz: Ta'lim orqali AKT innovatorlarini shakllantirish

source: TUIT, founded in 1955, offers cutting-edge ICT education with 23 programs, 14,632 students, and partnerships with 26 countries.
ru: ТУИТ, основанный в 1955 году, предлагает передовое образование в области ИКТ с 23 программами, 14 632 студентами и партнерствами с 26 странами.
uz: 1955-yilda tashkil etilgan TUIT 23 ta dastur, 14,632 talaba va 26 mamlakat bilan hamkorlik bilan eng zamonaviy AKT ta'limini taklif etadi.

source: Start Your Journey
ru: Начните свое путешествие
uz: Sayohatingizni boshlang

source: Discover Programs
ru: Ознакомьтесь с программами
uz: Dasturlarni kashf eting

source: Why Choose Us
ru: Почему выбирают нас
uz: Nega bizni tanlaysiz

source: High ICT Employment Success
ru: Высокий успех трудоустройства в ИКТ
uz: Yuqori AKT bandlik muvaffaqiyati

source: International Partners
ru: Международные партнеры
uz: Xalqaro hamkorlar

source: Student-Faculty Ratio
ru: Соотношение студентов и преподавателей
uz: Talaba-o‘qituvchi nisbati

source: Degree Directions
ru: Направления обучения
uz: Daraja yo‘nalishlari

source: Innovating ICT, <span>Building Global Leaders</span>
ru: Инновации в ИКТ, <span>Создание глобальных лидеров</span>
uz: AKT innovatsiyasi, <span>Global yetakchilarni shakllantirish</span>

source: Founded in 1955, TUIT leads in ICT education with 10,242 students across 23 programs and 42 partnerships with universities in 26 countries, driving technological excellence.
uz: 1955-yilda tashkil etilgan TUIT 10,242 talaba, 23 ta dastur va 26 mamlakatdagi 42 ta universitet bilan hamkorlik orqali AKT ta'limida yetakchilik qiladi, texnologik mukammallikni rivojlantiradi.

source: Years
ru: Годы
uz: Yillar

source: Students
ru: Студенты
uz: Talabalar

source: Teachers
ru: Преподаватели
uz: O‘qituvchilar

source: Our Values
ru: Наши ценности
uz: Bizning qadriyatlarimiz

source: Update to Excellence in academic pursuit, innovation in technology, integrity in research, and collaboration with 42 international partners to empower students and faculty.
ru: Стремление к совершенству в академической деятельности, инновации в технологиях, честность в исследованиях и сотрудничество с 42 международными партнерами для расширения возможностей студентов и преподавателей.
uz: Akademik intilishda mukammallikka yangilanish, texnologiyada innovatsiya, tadqiqotlarda halollik va talabalar va professor-o‘qituvchilarni kuchaytirish uchun 42 xalqaro hamkorlar bilan hamkorlik.

source: Recent News
ru: Последние новости
uz: So‘nggi yangiliklar

source: Excellence in Education for Over 70 Years
ru: Превосходство в образовании более 70 лет
uz: 70 yildan ortiq ta'limda mukammallik

source: Since 1955, TUIT has been at the forefront of technological education in Central Asia. Named after the legendary scholar Al-Khwarizmi, our university blends tradition with innovation to train future leaders in IT, cybersecurity, and telecommunications. With branches across Uzbekistan and a global vision, TUIT continues to lead in digital transformation.
ru: С 1955 года ТУИТ находится в авангарде технологического образования в Центральной Азии. Названный в честь великого учёного Аль-Хорезми, наш университет сочетает традиции и инновации, чтобы готовить будущих лидеров в области ИТ, кибербезопасности и телекоммуникаций. С филиалами по всему Узбекистану и глобальным видением, ТУИТ продолжает лидировать в цифровой трансформации.
uz: 1955-yildan beri TATU Markaziy Osiyoda texnologik taʼlimning yetakchisidir. Buyuk olim Al-Xorazmiy nomi bilan atalgan universitetimiz an’ana va innovatsiyalarni uygʻunlashtirib, IT, kiberxavfsizlik va telekommunikatsiya sohalarida kelajak yetakchilarini tayyorlaydi. Oʻzbekiston boʻylab filiallarga ega va global qarashlarga ega TATU raqamli transformatsiyada yetakchilikni davom ettirmoqda.

source: Learn More
ru: Узнать больше
uz: Ko‘proq bilib oling

source: Virtual Tour
ru: Виртуальный тур
uz: Virtual sayohat

source: Graduation Rate
ru: Процент выпуска
uz: Bitiruv darajasi

source: Degree Programs
ru: Образовательные программы
uz: Daraja dasturlari

source: Research Funding
ru: Финансирование исследований
uz: Tadqiqot moliyalashtirish

source: Top-Ranked Programs
ru: Программы с высоким рейтингом
uz: Eng yuqori darajali dasturlar

source: Award-winning programs built for innovation, leadership, and global impact.
ru: Программы, отмеченные наградами, созданные для инноваций, лидерства и глобального влияния.
uz: Innovatsiya, yetakchilik va global ta'sir uchun mo‘ljallangan mukofotlangan dasturlar.

source: State-of-the-Art Facilities
ru: Современные объекты
uz: Zamonaviy jihozlar

source: Modern labs and smart classrooms empower future-ready student learning.
ru: Современные лаборатории и умные классы способствуют обучению студентов, готовых к будущему.
uz: Zamonaviy laboratoriyalar va aqlli sinf xonalari kelajakka tayyor talaba ta'limini kuchaytiradi.

source: Global Alumni Network
ru: Глобальная сеть выпускников
uz: Global bitiruvchilar tarmog‘i

source: Worldwide alumni connections offering mentorship, opportunity, and lifelong support.
ru: Глобальные связи выпускников, предлагающие наставничество, возможности и пожизненную поддержку.
uz: Butun dunyo bo‘ylab bitiruvchilar aloqalari murabbiylik, imkoniyat va umrbod qo‘llab-quvvatlashni taklif etadi.

source: Discover Campus Life
ru: Откройте для себя жизнь в кампусе
uz: Kampus hayotini kashf eting

source: Explore More
ru: Узнать больше
uz: Ko‘proq kashf eting

source: Student Clubs
ru: Студенческие клубы
uz: Talaba klublari

source: Connect, lead, and grow through diverse interest-based student communities.
ru: Общайтесь, лидируйте и развивайтесь через разнообразные студенческие сообщества по интересам.
uz: Turli xil qiziqishlarga asoslangan talaba jamoalari orqali bog‘laning, yetakchilik qiling va o‘sib boring.

source: Sports Events
ru: Спортивные мероприятия
uz: Sport tadbirlari

source: Exciting competitions promote teamwork, fitness, and school spirit.
ru: Захватывающие соревнования способствуют командной работе, физической форме и школьному духу.
uz: Qiziqarli musobaqalar jamoaviy ish, jismoniy tayyorgarlik va maktab ruhini rivojlantiradi.

source: Arts &amp; Culture
ru: Искусство и культура
uz: San'at va madaniyat

source: Celebrate creativity and diversity through music, theater, and expression.
ru: Празднуйте творчество и разнообразие через музыку, театр и самовыражение.
uz: Musiqa, teatr va ifoda orqali ijodkorlik va xilma-xillikni nishonlang.

source: Global Experiences
ru: Глобальный опыт
uz: Xalqaro Tajriba

source: View All Student Activities
ru: Посмотреть все студенческие мероприятия
uz: Barcha talaba faoliyatlarini ko‘rish

source: TUIT International Affairs
ru: Международные связи ТУИТ
uz: TUIT Xalqaro aloqalar

source: <p>Amir Temur avenue 108</p> <p>Uzbekistan, Tashkent 100084</p>
ru: <p>Проспект Амира Темура 108</p> <p>Узбекистан, Ташкент 100084</p>
uz: <p>Amir Temur shohko‘chasi 108</p> <p>O‘zbekiston, Toshkent 100084</p>

source: Phone:
ru: Телефон:
uz: Telefon:

source: Email:
ru: Эл. почта:
uz: Elektr pochta:

source: Pages
ru: Страницы
uz: Sahifalar

source: About Us
ru: О нас
uz: Biz haqimizda

source: Contact Us
ru: Связаться с нами
uz: Biz bilan bog‘laning

source: Privacy policy
ru: Политика конфиденциальности
uz: Maxfiylik siyosati

source: Admission
ru: Поступление
uz: Qabul

source: Terms of Service
ru: Условия обслуживания
uz: Xizmat ko‘rsatish shartlari

source: Student Life
ru: Студенческая жизнь
uz: Talabalar hayoti

source: Academics
ru: Академические программы
uz: Akademiklar

source: Campus & Facilities
ru: Кампус и инфраструктура
uz: Kampus va jihozlar

source: Useful Links:
ru: Полезные ссылки:
uz: Foydali havolalar:

source: TUIT official website
ru: Официальный сайт ТУИТ
uz: TUIT rasmiy veb-sayti

source: Admission TUIT
ru: Поступление в ТУИТ
uz: TUIT qabuli

source: Community / Falco
ru: Сообщество / Falco
uz: Jamoa / Falco

source: useful link
ru: Полезная ссылка
uz: foydali havola

source: <p>© <span>Copyright</span> <strong class="px-1 sitename">TUIT International Affairs</strong> <span>All Rights Reserved</span> </p>
ru: <p>© <span>Авторское право</span> <strong class="px-1 sitename">Международные связи ТУИТ</strong> <span>Все права защищены</span> </p>
uz: <p>© <span>Mualliflik huquqi</span> <strong class="px-1 sitename">TUIT Xalqaro aloqalar</strong> <span>Barcha huquqlar himoyalangan</span> </p>

source: Campus &amp;Facilities
ru: Кампус и инфраструктура
uz: Kampus va jihozlar

source: News Details
ru: Подробности новости
uz: Yangiliklar tafsilotlari

source: News detail
ru: Подробности новости
uz: Yangilik tafsilotlari

source: Excellence in IT Education
ru: Превосходство в ИТ-образовании
uz: Axborot texnologiyalari ta'limida mukammallik

source: Shape Your Future with TUIT’s Premier Programs
ru: Формируйте свое будущее с ведущими программами ТУИТ
uz: TUITning eng yaxshi dasturlari bilan kelajagingizni shakllantiring

source: At Tashkent University of Information Technologies, we blend theory with real-world practice to prepare leaders in tech. Our programs are designed to meet global standards, with a focus on innovation and industry relevance.
ru: В Ташкентском университете информационных технологий мы сочетаем теорию с реальной практикой, чтобы подготовить лидеров в области технологий. Наши программы разработаны в соответствии с мировыми стандартами, с акцентом на инновации и актуальность для индустрии.
uz: Toshkent Axborot Texnologiyalari Universitetida biz nazariyani real dunyo amaliyoti bilan uyg‘unlashtirib, texnologiya sohasida yetakchilarni tayyorlaymiz. Bizning dasturlarimiz global standartlarga javob berishga mo‘ljallangan bo‘lib, innovatsiya va sanoat ahamiyatiga e'tibor qaratadi.

source: Hands-on tech labs & internships
ru: Практические технологические лаборатории и стажировки
uz: Amaliy texnologiya laboratoriyalari va amaliyotlar

source: Award-winning professors & industry experts
ru: Отмеченные наградами профессора и эксперты индустрии
uz: Mukofotlangan professorlar va sanoat mutaxassislari

source: Advanced research in AI, cybersecurity & more
ru: Передовые исследования в области ИИ, кибербезопасности и других направлениях
uz: Sun'iy intellekt, kiberxavfsizlik va boshqalarda ilg‘or tadqiqotlar

source: Download Program Full Detail
ru: Скачать информацию о программе
uz: Dastur tafsilotlarini yuklab oling

source: TUIT in Numbers
ru: ТУИТ в цифрах
uz: TUIT raqamlarda

source: Driving Innovation Through Education
ru: Движение инноваций через образование
uz: Ta'lim orqali innovatsiyani rivojlantirish

source: At TUIT, we measure success by the impact of our graduates and the breakthroughs in our labs. Here’s what sets us apart:
ru: В ТУИТ мы измеряем успех влиянием наших выпускников и прорывами в наших лабораториях. Вот что отличает нас:
uz: TUITda biz muvaffaqiyatni bitiruvchilarimizning ta'siri va laboratoriyalarimizdagi yutuqlar bilan o‘lchaymiz. Mana bizni ajratib turadigan narsalar:

source: About Our Institution
ru: О нашем учреждении
uz: Muassasamiz haqida

source: Student Satisfaction
ru: Удовлетворенность студентов
uz: Talaba qoniqish darajasi

source: Cutting-Edge Programs
ru: Передовые программы
uz: Eng zamonaviy dasturlar

source: Specialized Research Centers
ru: Специализированные исследовательские центры
uz: Maxsus tadqiqot markazlari

source: Graduate Employability
ru: Трудоустройство выпускников
uz: Bitiruvchilarning ishga joylashish darajasi

source: Campus &amp; Facilities
ru: Кампус и инфраструктура
uz: Kampus va jihozlar

source: Campus Facilities
ru: Инфраструктура кампуса
uz: Kampus jihozlari

source: Experience Our Campus
ru: Ознакомьтесь с нашим кампусом
uz: Kampusimizni his qiling

source: Discover state-of-the-art facilities designed to inspire learning and growth
ru: Откройте для себя современные объекты, созданные для вдохновения на обучение и развитие
uz: O‘qish va o‘sishni ilhomlantirish uchun mo‘ljallangan zamonaviy jihozlarni kashf eting

source: Explore TUIT – Where Innovation Meets Opportunity!
ru: Исследуйте ТУИТ – место, где инновации встречаются с возможностями!
uz: TUITni kashf eting – Innovatsiya imkoniyatlar bilan uchrashadigan joy!

source: Acres
ru: Гектары
uz: Gektar

source: Buildings
ru: Здания
uz: Binolar

source: Academic
ru: Академические
uz: Akademik

source: Athletic
ru: Спортивные
uz: Sport

source: Residential
ru: Жилые
uz: Turar joy

source: Class Room
ru: Учебный класс
uz: Sinf xonasi

source: World-Class Learning Spaces
ru: Учебные пространства мирового класса
uz: Jahon darajasidagi o‘quv joylari

source: TUIT stands at the forefront of technological education, offering state-of-the-art facilities that foster academic excellence and research innovation...
ru: ТУИТ находится на передовой технологического образования, предлагая современные объекты, способствующие академическому превосходству и инновациям в исследованиях...
uz: TUIT texnologik ta'limning oldingi safida turib, akademik mukammallik va tadqiqot innovatsiyasini rivojlantiruvchi zamonaviy jihozlarni taklif etadi...

source: Modern classrooms with smart technology
ru: Современные классы с умными технологиями
uz: Aqlli texnologiyali zamonaviy sinf xonalari

source: Specialized research laboratories
ru: Специализированные исследовательские лаборатории
uz: Maxsus tadqiqot laboratoriyalari

source: Collaborative study spaces
ru: Пространства для совместного обучения
uz: Hamkorlikdagi o‘quv joylari

source: Advanced technology centers
ru: Передовые технологические центры
uz: Ilg‘or texnologiya markazlari

source: Technology Labs
ru: Технологические лаборатории
uz: Texnologiya laboratoriyalari

source: Through international collaborations, TUIT has developed 16 educational laboratories and 9 computer classrooms. Notable centers include the Uzbek-Indian Center of Information Technologies and the Uzbek-Korean Center for Information Technologies, enhancing practical learning experiences.
ru: Благодаря международному сотрудничеству ТУИТ создал 16 учебных лабораторий и 9 компьютерных классов. Примечательные центры включают Узбекско-Индийский центр информационных технологий и Узбекско-Корейский центр информационных технологий, улучшающие практический опыт обучения.
uz: Xalqaro hamkorliklar orqali TUIT 16 ta o‘quv laboratoriyasi va 9 ta kompyuter sinf xonasini ishlab chiqdi. E’tiborli markazlar orasida O‘zbek-Hind Axborot Texnologiyalari Markazi va O‘zbek-Koreya Axborot Texnologiyalari Markazi mavjud bo‘lib, ular amaliy o‘quv tajribalarini oshiradi.

source: 16 Labs
ru: 16 лабораторий
uz: 16 ta laboratoriya

source: Research Centers
ru: Исследовательские центры
uz: Tadqiqot markazlari

source: The TUIT Incubation Center, established in 2022, supports students in developing innovative startup projects, particularly in software development, robotics, and design. Additionally, the Center for Scientific Research and Technology Transfer facilitates advanced research initiatives.
ru: Инкубационный центр ТУИТ, созданный в 2022 году, поддерживает студентов в разработке инновационных стартап-проектов, особенно в области разработки программного обеспечения, робототехники и дизайна. Кроме того, Центр научных исследований и передачи технологий способствует передовым исследовательским инициативам.
uz: 2022-yilda tashkil etilgan TUIT Inkubatsiya Markazi talabalarni, ayniqsa, dasturiy ta'minot ishlab chiqish, robototexnika va dizayn bo‘yicha innovatsion startap loyihalarini ishlab chiqishda qo‘llab-quvvatlaydi. Bundan tashqari, Ilmiy Tadqiqotlar va Texnologiya Transfer Markazi ilg‘or tadqiqot tashabbuslarini qo‘llab-quvvatlaydi.

source: Facilities
ru: Инфраструктура
uz: Jihozlar

source: Sports Complex
ru: Спортивный комплекс
uz: Sport majmuasi

source: State-of-the-Art Athletic Facilities
ru: Современные спортивные сооружения
uz: Zamonaviy sport jihozlari

source: TUIT offers a dynamic and modern sports infrastructure designed to promote student wellness and athletic excellence. Whether you're a professional athlete or just keeping fit, our facilities support all your needs.
ru: ТУИТ предлагает динамичную и современную спортивную инфраструктуру, созданную для поддержания здоровья студентов и спортивного совершенства. Будь вы профессиональным спортсменом или просто поддерживаете форму, наши сооружения удовлетворят все ваши потребности.
uz: TUIT talabalar salomatligi va sport mukammalligini rivojlantirish uchun mo‘ljallangan dinamik va zamonaviy sport infratuzilmasini taklif etadi. Professional sportchi bo‘lasizmi yoki shunchaki sog‘lig‘ingizni saqlasangiz ham, bizning jihozlarimiz barcha ehtiyojlaringizni qo‘llab-quvvatlaydi.

source: Olympic-sized football grounds
ru: Футбольные поля олимпийского размера
uz: Olimpiada o‘lchamidagi futbol maydonlari

source: Multi-purpose sports courts
ru: Многофункциональные спортивные площадки
uz: Ko‘p maqsadli sport maydonchalari

source: Professional running track
ru: Профессиональная беговая дорожка
uz: Professional yugurish yo‘laklari

source: Fitness and training centers
ru: Фитнес- и тренировочные центры
uz: Fitnes va mashg‘ulot markazlari

source: Football Grounds
ru: Футбольные поля
uz: Futbol maydonlari

source: TUIT features a newly renovated football field that meets international standards, enabling students to train and participate in university-level championships and tournaments.
ru: ТУИТ располагает недавно отремонтированным футбольным полем, соответствующим международным стандартам, что позволяет студентам тренироваться и участвовать в университетских чемпионатах и турнирах.
uz: TUIT xalqaro standartlarga javob beradigan yangi ta'mirlangan futbol maydoniga ega bo‘lib, talabalarga universitet darajasidagi chempionatlar va turnirlarda ishtirok etish va mashq qilish imkonini beradi.

source: Olympic Standard
ru: Олимпийский стандарт
uz: Olimpiada standarti

source: Training Facilities
ru: Тренировочные сооружения
uz: Mashg‘ulot jihozlari

source: Our indoor training halls are equipped with advanced fitness gear and conditioning tools, supporting students' physical education and team sports training programs.
ru: Наши крытые тренировочные залы оснащены современным фитнес-оборудованием и инструментами для кондиционирования, поддерживая программы физического воспитания студентов и тренировки командных видов спорта.
uz: Bizning yopiq mashg‘ulot zallarimiz ilg‘or fitnes jihozlari va konditsioner asboblar bilan jihozlangan bo‘lib, talabalarning jismoniy tarbiya va jamoaviy sport mashg‘ulotlari dasturlarini qo‘llab-quvvatlaydi.

source: Pro Equipment
ru: Профессиональное оборудование
uz: Professional jihozlar

source: Residence Halls
ru: Общежития
uz: Turar joy zallari

source: Comfortable Living Environments
ru: Комфортные условия проживания
uz: Qulay yashash muhitlari

source: Our campus housing offers students a perfect blend of comfort, convenience, and community. Whether you prefer quiet study spaces or lively common areas, our residence halls are designed to support your lifestyle. With fully furnished rooms, modern amenities, and a welcoming atmosphere, you’ll feel right at home from day one.
ru: Наше жилье на кампусе предлагает студентам идеальное сочетание комфорта, удобства и сообщества. Предпочитаете ли вы тихие учебные пространства или оживленные общие зоны, наши общежития созданы для поддержки вашего образа жизни. С полностью меблированными комнатами, современными удобствами и гостеприимной атмосферой вы почувствуете себя как дома с первого дня.
uz: Bizning kampus turar joylarimiz talabalarga qulaylik, qulaylik va jamoa uyg‘unligini taklif etadi. Tinim bilmaydigan o‘quv joylarini yoki jonli umumiy joylarni afzal ko‘rasizmi, bizning turar joy zallarimiz sizning turmush tarzingizni qo‘llab-quvvatlash uchun mo‘ljallangan. To‘liq jihozlangan xonalar, zamonaviy qulayliklar va mehmondo‘st muhit bilan siz birinchi kundan o‘zingizni uyda his qilasiz.

source: Modern residence halls
ru: Современные общежития
uz: Zamonaviy turar joy zallari
