Repository: bobur22/global-tuitUZ
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: No file was submitted.
uz: Hech qanday fayl topshirilmadi.

source: The submitted file is empty.
uz: Topshirilgan fayl bo‘sh.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
uz: Bu fayl nomi ko‘pi bilan %(max)d ta belgidan iborat bo‘lishini ta'minlang (hozir %(length)d ta).

source: Please either submit a file or check the clear checkbox, not both.
uz: Iltimos, faylni topshiring yoki tozalash katakchasini belgilang, ikkalasini ham emas.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
uz: To‘g‘ri rasmni yuklang. Siz yuklagan fayl rasm emas yoki buzilgan rasm.

source: Select a valid choice. %(value)s is not one of the available choices.
uz: To‘g‘ri tanlovni tanlang. %(value)s mavjud tanlovlardan biri emas.

source: Enter a list of values.
uz: Qiymatlar ro‘yxatini kiriting.

source: Enter a complete value.
uz: To‘liq qiymatni kiriting.

source: Enter a valid UUID.
uz: To‘g‘ri UUID ni kiriting.

source: Enter a valid JSON.
uz: To‘g‘ri JSON ni kiriting.

source: (Hidden field %(name)s) %(error)s
uz: (Yashirin maydon %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
uz: ManagementForm ma'lumotlari yo‘q yoki o‘zgartirilgan. Yo‘qolgan maydonlar: %(field_names)s. Agar muammo davom etsa, xato haqida hisobot yuborishingiz kerak bo‘lishi mumkin.

source: Please submit at most %(num)d form.
uz: Iltimos, ko‘pi bilan %(num)d ta shakl topshiring.

source: Please submit at least %(num)d form.
uz: Iltimos, kamida %(num)d ta shakl topshiring.

source: Order
uz: Tartib

source: Delete
uz: O‘chirish

source: Please correct the duplicate data for %(field)s.
uz: Iltimos, %(field)s uchun takroriy ma'lumotlarni tuzating.

source: Please correct the duplicate data for %(field)s, which must be unique.
uz: Iltimos, yagona bo‘lishi kerak bo‘lgan %(field)s uchun takroriy ma'lumotlarni tuzating.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
uz: Iltimos, %(date_field)s da %(lookup)s uchun yagona bo‘lishi kerak bo‘lgan %(field_name)s uchun takroriy ma'lumotlarni tuzating.

source: Please correct the duplicate values below.
uz: Iltimos, quyidagi takroriy qiymatlarni tuzating.

source: The inline value did not match the parent instance.
uz: Ichki qiymat ota instansiyaga mos kelmadi.

source: Select a valid choice. That choice is not one of the available choices.
uz: To‘g‘ri tanlovni tanlang. Bu tanlov mavjud tanlovlardan biri emas.

source: “%(pk)s” is not a valid value.
uz: “%(pk)s” to‘g‘ri qiymat emas.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
uz: %(datetime)s vaqt mintaqasida %(current_timezone)s talqin qilinmadi; bu noaniq yoki mavjud emas bo‘lishi mumkin.

source: Clear
uz: Tozalash

source: Currently
uz: Hozirda

source: Change
uz: O‘zgartirish

source: Unknown
uz: Noma'lum

source: Yes
uz: Ha

source: No
uz: Yo‘q

source: yes,no,maybe
uz: ha,yo‘q,ehtimol

source: %(size)d byte
uz: %(size)d bayt

source: p.m.
uz: tushdan keyin

source: a.m.
uz: tushdan oldin

source: PM
uz: TK

source: AM
uz: TO

source: midnight
uz: yarim tun

source: noon
uz: tush

source: Monday
uz: Dushanba

source: Tuesday
uz: Seshanba

source: Wednesday
uz: Chorshanba

source: Thursday
uz: Payshanba

source: Friday
uz: Juma

source: Saturday
uz: Shanba

source: Sunday
uz: Yakshanba

source: Mon
uz: Dush

source: Tue
uz: Sesh

source: Wed
uz: Chor

source: Thu
uz: Pay

source: Fri
uz: Jum

source: Sat
uz: Sh

source: January
uz: Yanvar

source: February
uz: Fevral

source: March
uz: Mart

source: April
uz: Aprel

source: June
uz: Iyun

source: July
uz: Iyul

source: August
uz: Avgust

source: September
uz: Sentyabir

source: October
uz: Oktabir

source: November
uz: Noyabir

source: December
uz: Dekabir

source: jan
uz: yam

source: feb
uz: fev

source: jun
uz: iyun

source: jul
uz: iyul

source: aug
uz: avg

source: sep
uz: sen

source: oct
uz: okt

source: nov
uz: noy

source: dec
uz: dek

source: Russian
ru: Русский

source: Telegram ID
ru: Идентификатор Telegram

source: Telegram Bot
ru: Telegram-бот

source: icon bi
ru: Иконка bi

source: Explore More Falco Stories
ru: Узнайте больше историй Falco

source: Founded in 1955, TUIT leads in ICT education with 10,242 students across 23 programs and 42 partnerships with universities in 26 countries, driving technological excellence.
ru: Основанный в 1955 году, ТУИТ лидирует в образовании в области ИКТ с 10 242 студентами по 23 программам и 42 партнерствами с университетами в 26 странах, обеспечивая технологическое превосходство.

source: Students Life
ru: Студенческая жизнь

source: Explore new cultures with international exchanges, programs, and partnerships.
ru: Исследуйте новые культуры через международные обмены, программы и партнерства.

source: LMS TUIT
ru: LMS ТУИТ

source: Linked In TUIT
ru: LinkedIn ТУИТ
