Repository: bobur22/global-tuitUZ
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Uzbek
uz: O‘zbek

source: news header
ru: Заголовок новости
uz: Yangiliklar sarlavhasi

source: Please enter the header of the news !
ru: Пожалуйста, введите заголовок новости!
uz: Iltimos, yangiliklar sarlavhasini kiriting!

source: news paragraph
ru: Параграф новости
uz: Yangiliklar paragrafi

source: Please enter the paragraph of the news !
ru: Пожалуйста, введите текст новости!
uz: Iltimos, yangiliklar paragrafini kiriting!

source: news date
ru: Дата новости
uz: Yangiliklar sanasi

source: Please enter the date of the news !.
ru: Пожалуйста, введите дату новости!
uz: Iltimos, yangiliklar sanasini kiriting!

source: news view counter
ru: Счетчик просмотров новости
uz: Yangiliklar ko‘rish hisoblagichi

source: This is newses view counter don't change it!
ru: Это счетчик просмотров новостей, не изменяйте его!
uz: Bu yangiliklar ko‘rish hisoblagichi, uni o‘zgartirmang!

source: news image
ru: Изображение новости
uz: Yangiliklar rasmi

source: Please upload your image !
ru: Пожалуйста, загрузите ваше изображение!
uz: Iltimos, rasmni yuklang!

source: News
ru: Новости
uz: Yangiliklar

source: full name
ru: Полное имя
uz: To‘liq ism

source: Please, fill your full name.
ru: Пожалуйста, укажите ваше полное имя.
uz: Iltimos, to‘liq ismingizni to‘ldiring.

source: email
ru: Электронная почта
uz: Elektron pochta

source: Please, fill your email.
ru: Пожалуйста, укажите вашу электронную почту.
uz: Iltimos, elektron pochtangizni to‘ldiring.

source: subject
ru: Тема
uz: Mavzu

source: Please, fill the subject.
ru: Пожалуйста, укажите тему.
uz: Iltimos, mavzuni to‘ldiring.

source: message
ru: Сообщение
uz: Xabar

source: Please, fill the message.
ru: Пожалуйста, напишите сообщение.
uz: Iltimos, xabarni to‘ldiring.

source: Contact
ru: Контакты
uz: Aloqa

source: Contacts
ru: Контакты
uz: Aloqalar

source: infrostructure image
ru: Изображение инфраструктуры
uz: Infratuzilma rasmi

source: infrostructure header
ru: Заголовок инфраструктуры
uz: Infratuzilma sarlavhasi

source: Please, enter the header.
ru: Пожалуйста, введите заголовок.
uz: Iltimos, sarlavhani kiriting.

source: infrostructure paragraph
ru: Параграф инфраструктуры
uz: Infratuzilma paragrafi

source: Please, enter the paragraph.
ru: Пожалуйста, введите текст.
uz: Iltimos, paragrafni kiriting.

source: Infrastructure
ru: Инфраструктура
uz: Infratuzilma

source: Infrastructures
ru: Инфраструктуры
uz: Infratuzilmalar

source: nation
ru: Страна
uz: Millat

source: Please enter the nation of the university.
ru: Пожалуйста, укажите страну университета.
uz: Iltimos, universitet millatini kiriting.

source: university name
ru: Название университета
uz: Universitet nomi

source: Please enter the name of the university.
ru: Пожалуйста, укажите название университета.
uz: Iltimos, universitet nomini kiriting.

source: university link
ru: Ссылка на университет
uz: Universitet havolasi

source: Please enter the link of the university.
ru: Пожалуйста, укажите ссылку на университет.
uz: Iltimos, universitet havolasini kiriting.

source: university date
ru: Дата сотрудничества
uz: Universitet sanasi

source: Please enter the date of the university.
ru: Пожалуйста, укажите дату сотрудничества с университетом.
uz: Iltimos, universitet sanasini kiriting.

source: Partner University
ru: Партнерский университет
uz: Hamkor universitet

source: Partner Universities
ru: Партнерские университеты
uz: Hamkor universitetlar

source: Please enter the Telegram ID.
ru: Пожалуйста, укажите идентификатор Telegram.
uz: Iltimos, Telegram ID ni kiriting.

source: Please enter the Telegram Bot token.
ru: Пожалуйста, укажите токен Telegram-бота.
uz: Iltimos, Telegram Bot tokenini kiriting.

source: TelegramData
ru: Данные Telegram
uz: Telegram ma'lumotlari

source: semester name
ru: Название семестра
uz: Semestr nomi

source: Please enter the semester name.
ru: Пожалуйста, укажите название семестра.
uz: Iltimos, semestr nomini kiriting.

source: semester date
ru: Дата семестра
uz: Semestr sanasi

source: Please enter the semester date.
ru: Пожалуйста, укажите дату семестра.
uz: Iltimos, semestr sanasini kiriting.

source: Admission Deadline
ru: Срок подачи заявлений
uz: Qabul muddati

source: Admission Deadlines
ru: Сроки подачи заявлений
uz: Qabul muddatlari

source: Doctoral
ru: Докторантура
uz: Doktorlik

source: Undergraduate
ru: Бакалавриат
uz: Bakalavriat

source: Graduate
ru: Магистратура
uz: Magistratura

source: Program
ru: Программа
uz: Dastur

source: Certification
ru: Сертификация
uz: Sertifikat

source: doctoral
ru: докторантура
uz: doktorlik

source: undergraduate
ru: бакалавриат
uz: bakalavriat

source: graduate
ru: магистратура
uz: magistratura

source: program
ru: программа
uz: dastur

source: certification
ru: сертификация
uz: sertifikat

source: Type of Study
ru: Тип обучения
uz: Ta'lim turi

source: Please choose the type of study.
ru: Пожалуйста, выберите тип обучения.
uz: Iltimos, ta'lim turini tanlang.

source: Education Name
ru: Название образовательной программы
uz: Ta'lim nomi

source: Please enter the name of the education.
ru: Пожалуйста, укажите название образовательной программы.
uz: Iltimos, ta'lim nomini kiriting.

source: Education Detail
ru: Подробности образовательной программы
uz: Ta'lim tafsilotlari

source: Please enter the detail of the education.
ru: Пожалуйста, укажите подробности образовательной программы.
uz: Iltimos, ta'lim tafsilotlarini kiriting.

source: Duration
ru: Продолжительность
uz: Davomiyligi

source: Please enter the duration of the education.
ru: Пожалуйста, укажите продолжительность обучения.
uz: Iltimos, ta'lim davomiyligini kiriting.

source: Please enter the certification of the education.
ru: Пожалуйста, укажите сертификацию образовательной программы.
uz: Iltimos, ta'lim sertifikatini kiriting.

source: Start of Period
ru: Начало периода
uz: Davning boshlanishi

source: Please enter the start period of the education.
ru: Пожалуйста, укажите начало периода обучения.
uz: Iltimos, ta'lim davrining boshlanishini kiriting.

source: Academic Program's file
ru: Файл академической программы
uz: Akademik dastur fayli

source: Please enter the link of the academic program.
ru: Пожалуйста, укажите ссылку на академическую программу.
uz: Iltimos, akademik dastur havolasini kiriting.

source: Please choose the type of icon bi bi
ru: Пожалуйста, выберите тип иконки bi bi.
uz: Iltimos, belgi bi bi turini tanlang.

source: Color Type
ru: Тип цвета
uz: Rang turi

source: Please choose the type of color.
ru: Пожалуйста, выберите тип цвета.
uz: Iltimos, rang turini tanlang.

source: Academic Program
ru: Академическая программа
uz: Akademik dastur

source: Academic Programs
ru: Академические программы
uz: Akademik dasturlar

source: Enter a valid full name.(without numbers)
ru: Введите корректное полное имя (без цифр).
uz: To‘g‘ri to‘liq ism kiriting (raqamlarsiz).

source: Enter a valid full name that contains first name and last name
ru: Введите корректное полное имя, содержащее имя и фамилию.
uz: Ism va familiyadan iborat to‘g‘ri to‘liq ism kiriting.

source: Not Found
ru: Не найдено
uz: Topilmadi

source: Home
ru: Главная
uz: Bosh sahifa

source: Error
ru: Ошибка
uz: Xato

source: Page Not Found
ru: Страница не найдена
uz: Sahifa topilmadi

source: The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.
ru: Страница, которую вы ищете, могла быть удалена, переименована или временно недоступна.
uz: Siz izlayotgan sahifa o‘chirilgan, nomi o‘zgartirilgan yoki vaqtincha mavjud emas bo‘lishi mumkin.

source: Back to Home
ru: Вернуться на главную
uz: Bosh sahifaga qaytish

source: Help Center
ru: Центр помощи
uz: Yordam markazi

source: You might want to:
ru: Вы можете:
uz: Siz xohlashingiz mumkin:

source: Check our sitemap
ru: Проверить карту сайта
uz: Sayt xaritamizni tekshiring

source: Contact support
ru: Связаться с поддержкой
uz: Yordam bilan bog‘laning

source: Return to previous page
ru: Вернуться на предыдущую страницу
uz: Oldingi sahifaga qaytish

source: About
ru: О нас
uz: Haqida

source: Our Story
ru: Наша история
uz: Bizning hikoyamiz

source: Educating Minds, Inspiring Hearts
ru: Образование умов, вдохновение сердец
uz: Aqlni tarbiyalash, yuraklarni ilhomlantirish

source: Founded in 1955, the Tashkent University of Information Technologies (TUIT) has evolved from a regional communication institute into Uzbekistan’s leading hub for IT education and research. With a strong focus on innovation, global cooperation, and academic excellence, TUIT empowers students to drive digital transformation across Central Asia and beyond.
ru: Основанный в 1955 году, Ташкентский университет информационных технологий (ТУИТ) превратился из регионального института связи в ведущий центр Узбекистана по образованию и исследованиям в области ИТ. С акцентом на инновации, глобальное сотрудничество и академическое превосходство, ТУИТ дает студентам возможность руководить цифровой трансформацией в Центральной Азии и за ее пределами.
uz: 1955-yilda tashkil etilgan Toshkent Axborot Texnologiyalari Universiteti (TUIT) mintaqaviy aloqa institutidan O‘zbekistonning axborot texnologiyalari sohasidagi yetakchi ta'lim va tadqiqot markaziga aylandi. Innovatsiyalar, global hamkorlik va akademik mukammallikka katta e'tibor qaratgan holda, TUIT talabalarga Markaziy Osiyo va undan tashqarida raqamli transformatsiyani boshqarish imkonini beradi.

source: Tashkent Electrotechnical Institute of Communications (TEIC).
ru: Ташкентский электротехнический институт связи (ТЭИС).
uz: Toshkent Elektrotexnika Aloqa Instituti (TEIC).

source: Correspondence faculty base stations of TEIC were opened in Frunze (now Bishkek), in Dushanbe, Almaty and the cities of Fergana.
ru: Филиалы заочного факультета ТЭИС были открыты в Фрунзе (ныне Бишкек), Душанбе, Алматы и городах Ферганы.
uz: TEICning sirtqi ta'lim fakulteti baza stansiyalari Frunze (hozirgi Bishkek), Dushanbe, Almaty va Farg‘ona shaharlarida ochildi.

source: Formation of the Institute under the Central Asian Telecommunications Training Centre in order to train engineers and technical staff for networks in Central Asian Republics, Mongolia, India and Pakistan.
ru: Создание института под эгидой Центральноазиатского учебного центра телекоммуникаций для подготовки инженеров и технического персонала для сетей в республиках Центральной Азии, Монголии, Индии и Пакистана.
uz: Markaziy Osiyo respublikalari, Mo‘g‘uliston, Hindiston va Pokistondagi tarmoqlar uchun muhandislar va texnik xodimlarni tayyorlash maqsadida institut Markaziy Osiyo Telekommunikatsiya O‘quv Markazi qoshida tashkil etildi.

source: TEIC was renamed into Tashkent University of Information Technologies (TUIT) according to the Decree of the President of the Republic of Uzbekistan 2005 - Regional branches of TUIT were opened in Karshi, Nukus, Samarkand, Urgench and Fergana cities.
ru: ТЭИС был переименован в Ташкентский университет информационных технологий (ТУИТ) в соответствии с Указом Президента Республики Узбекистан 2005 года. Региональные филиалы ТУИТ были открыты в городах Карши, Нукус, Самарканд, Ургенч и Фергана.
uz: TEIC O‘zbekiston Respublikasi Prezidentining 2005-yildagi farmoniga ko‘ra Toshkent Axborot Texnologiyalari Universiteti (TUIT) deb nomlandi - TUITning Qarshi, Nukus, Samarqand, Urganch va Farg‘ona shaharlarida mintaqaviy filiallar ochildi.

source: Our Mission
ru: Наша миссия
uz: Bizning missiyamiz

source: To educate and prepare highly skilled specialists in information and communication technologies, fostering scientific innovation, ethical leadership, and community-driven development in Uzbekistan and the global IT landscape.
ru: Обучать и готовить высококвалифицированных специалистов в области информационных и коммуникационных технологий, способствуя научным инновациям, этическому лидерству и развитию, ориентированному на сообщество, в Узбекистане и на глобальной ИТ-арене.
uz: O‘zbekiston va global axborot texnologiyalari sohasida ilmiy innovatsiyalar, axloqiy yetakchilik va jamiyatga yo‘naltirilgan rivojlanishni qo‘llab-quvvatlash orqali axborot va kommunikatsiya texnologiyalari sohasida yuqori malakali mutaxassislarni tarbiyalash va tayyorlash.

source: Our Vision
ru: Наше видение
uz: Bizning vizyonimiz

source: To become a regional leader in digital transformation and a global center for excellence in IT education, research, and innovation, shaping the future of information technology across borders.
ru: Стать региональным лидером в области цифровой трансформации и глобальным центром превосходства в ИТ-образовании, исследованиях и инновациях, формируя будущее информационных технологий за пределами границ.
uz: Raqamli transformatsiyada mintaqaviy yetakchi va axborot texnologiyalari bo‘yicha ta'lim, tadqiqot va innovatsiyalarda global mukammallik markazi bo‘lish, chegaralar bo‘ylab axborot texnologiyalari kelajagini shakllantirish.

source: Core Values
ru: Основные ценности
uz: Asosiy qadriyatlar

source: Academic Excellence
ru: Академическое превосходство
uz: Akademik mukammallik

source: We uphold the highest standards of teaching and research, empowering students and faculty to reach their full intellectual and professional potential.
ru: Мы придерживаемся высочайших стандартов преподавания и исследований, предоставляя студентам и преподавателям возможность полностью реализовать свой интеллектуальный и профессиональный потенциал.
uz: Biz o‘qitish va tadqiqotning eng yuqori standartlarini qo‘llab-quvvatlaymiz, talabalar va professor-o‘qituvchilarga ularning to‘liq intellektual va professional salohiyatiga erishish imkonini beramiz.

source: Community Engagement
ru: Вовлеченность сообщества
uz: Jamiyat bilan hamkorlik

source: We actively collaborate with local and international partners to address real-world challenges and foster inclusive development.
ru: Мы активно сотрудничаем с местными и международными партнерами для решения реальных проблем и содействия инклюзивному развитию.
uz: Biz mahalliy va xalqaro hamkorlar bilan faol hamkorlik qilamiz, real dunyo muammolarini hal qilish va inklyuziv rivojlanishni qo‘llab-quvvatlash uchun.

source: Innovation
ru: Инновации
uz: Innovatsiya

source: We champion forward-thinking solutions through advanced research, cutting-edge technology, and a strong entrepreneurial spirit.
ru: Мы поддерживаем передовые решения через передовые исследования, современные технологии и сильный предпринимательский дух.
uz: Biz ilg‘or tadqiqotlar, eng zamonaviy texnologiyalar va kuchli tadbirkorlik ruhini qo‘llab-quvvatlaymiz.

source: Global Perspective
ru: Глобальная перспектива
uz: Global nuqtai nazar

source: With partnerships in over 26 countries, we prepare students to thrive in an interconnected world and lead global digital initiatives.
ru: С партнерствами в более чем 26 странах мы готовим студентов к процветанию в взаимосвязанном мире и лидерству в глобальных цифровых инициативах.
uz: 26 dan ortiq mamlakatlardagi hamkorliklar bilan biz talabalarni global dunyoda muvaffaqiyat qozonish va global raqamli tashabbuslarni boshqarish uchun tayyorlaymiz.

source: Admissions
ru: Поступление
uz: Qabul

source: Begin Your Academic Journey Today
ru: Начните свое академическое путешествие сегодня
uz: Bugun akademik sayohatingizni boshlang

source: Ready to embark on a transformative path? Begin your academic journey today with us and discover a world of knowledge, growth, and endless opportunities awaiting you.
ru: Готовы отправиться в трансформационное путешествие? Начните свое академическое путешествие с нами сегодня и откройте мир знаний, роста и бесконечных возможностей.
uz: O‘zgaruvchan yo‘lga kirishga tayyormisiz? Bugun biz bilan akademik sayohatingizni boshlang va bilim, o‘sish va cheksiz imkoniyatlar dunyosini kashf eting.

source: How to Apply
ru: Как подать заявку
uz: Qanday qilib ariza berish

source: Submit Application
ru: Подать заявку
uz: Ariza topshirish

source: Effortlessly submit your application online, beginning your journey with us with ease and convenience.
ru: Легко подайте заявку онлайн, начав свое путешествие с нами с легкостью и удобством.
uz: Onlayn arizangizni osongina topshiring, biz bilan sayohatingizni qulaylik bilan boshlang.

source: Send Documents
ru: Отправить документы
uz: Hujjatlarni yuborish

source: Carefully prepare and send all required supporting documents to complete your comprehensive application file.
ru: Тщательно подготовьте и отправьте все необходимые подтверждающие документы, чтобы завершить ваше полное досье.
uz: Barcha zarur hujjatlarni diqqat bilan tayyorlang va to‘liq ariza faylingizni yakunlash uchun yuboring.

source: Interview Process
ru: Процесс собеседования
uz: Suhbat jarayoni

source: Participate in our interview process, a valuable opportunity for us to learn more about your aspirations.
ru: Участвуйте в нашем процессе собеседования — это ценная возможность для нас узнать больше о ваших стремлениях.
uz: Suhbat jarayonimizda ishtirok eting, bu bizga sizning orzu-niyatlaringiz haqida ko‘proq bilish uchun qimmatli imkoniyatdir.

source: Receive Decision
ru: Получить решение
uz: Qarorni qabul qilish

source: Anticipate receiving your admission decision, marking an exciting milestone in your academic pursuit.
ru: Ожидайте получения решения о зачислении, что станет захватывающим этапом в вашем академическом пути.
uz: Qabul qarorini kuting, bu sizning akademik yo‘lingizdagi muhim bosqichdir.

source: Key Admission Deadlines
ru: Ключевые сроки подачи заявлений
uz: Asosiy qabul muddatlari

source: Admission Requirements
ru: Требования для поступления
uz: Qabul talablari

source: Academic Records
ru: Академические записи
uz: Akademik yozuvlar

source: Scan your certificate or diploma with subjects and grades. Master’s applicants should include their bachelor’s diploma.
ru: Отсканируйте ваш аттестат или диплом с указанием предметов и оценок. Кандидаты на магистратуру должны включить диплом бакалавра.
uz: Sertifikat yoki diplomingizni fanlar va baholar bilan skanerlang. Magistratura uchun ariza beruvchilar bakalavr diplomini kiritishlari kerak.

source: Passport
ru: Паспорт
uz: Pasport

source: Scan the main page of your passport (PDF format).
ru: Отсканируйте основную страницу вашего паспорта (в формате PDF).
uz: Pasportingizning asosiy sahifasini skanerlang (PDF formatida).

source: Photo
ru: Фотография
uz: Rasm

source: An electronic photo (3.5 cm x 4.5 cm) taken within the last 3 months.
ru: Электронная фотография (3,5 см x 4,5 см), сделанная в последние 3 месяца.
uz: Oxirgi 3 oy ichida olingan elektron rasm (3.5 sm x 4.5 sm).

source: English Proficiency
ru: Владение английским языком
uz: Ingliz tili bilimi

source: Submit your IELTS (5.5 or higher) or TOEFL iBT (71 or higher) certificate.
ru: Предоставьте сертификат IELTS (5.5 или выше) или TOEFL iBT (71 или выше).
uz: IELTS (5.5 yoki undan yuqori) yoki TOEFL iBT (71 yoki undan yuqori) sertifikatingizni topshiring.

source: Request Information
ru: Запросить информацию
uz: Ma'lumot so‘rash

source: To request detailed information and apply, please visit our dedicated contact section. For a quicker response and immediate action, simply press the 'Submit Request' button below.
ru: Чтобы запросить подробную информацию и подать заявку, посетите наш специальный раздел контактов. Для более быстрого ответа и немедленных действий просто нажмите кнопку «Отправить запрос» ниже.
uz: Batafsil ma'lumot so‘rash va ariza berish uchun iltimos, maxsus aloqa bo‘limimizga tashrif buyuring. Tezroq javob olish va darhol harakat qilish uchun quyidagi 'So‘rov yuborish' tugmasini bosing.

source: Submit Request
ru: Отправить запрос
uz: So‘rov yuborish

source: Visit Our Campus
ru: Посетите наш кампус
uz: Kampusimizga tashrif buyuring

source: Visit our campus to discover your future and see where you'll thrive.
ru: Посетите наш кампус, чтобы узнать о своем будущем и увидеть, где вы будете процветать.
uz: Kelajagingizni kashf qilish va muvaffaqiyat qozonadigan joyni ko‘rish uchun kampusimizga tashrif buyuring.

source: View Campus
ru: Посмотреть кампус
uz: Kampusni ko‘rish

source: Ready to Apply?
ru: Готовы подать заявку?
uz: Ariza berishga tayyormisiz?

source: Ready to apply? Start your application now and take the next step.
ru: Готовы подать заявку? Начните оформление сейчас и сделайте следующий шаг.
uz: Ariza berishga tayyormisiz? Hozir arizangizni boshlang va keyingi qadamni qo‘ying.

source: Start Application
ru: Начать подачу заявки
uz: Arizani boshlash

source: International Affairs Office
ru: Офис международных связей
uz: Xalqaro aloqalar bo‘limi

source: International Affairs
ru: Международные связи
uz: Xalqaro aloqalar

source: Partners
ru: Партнеры
uz: Hamkorlar

source: Nation
ru: Страна
uz: Millat

source: Name
ru: Название
uz: Nomi

source: Connection Date
ru: Дата установления связи
uz: Ulanish sanasi

source: Falco Community
ru: Сообщество Falco
uz: Falco jamoasi

source: Community
ru: Сообщество
uz: Jamoa

source: About Falco
ru: О Falco
uz: Falco haqida

source: Falco — where Uzbekistan’s future leaders unite Real opportunities. Big impact. Serious work, Cool team, Endless growth.
ru: Falco — место, где объединяются будущие лидеры Узбекистана. Реальные возможности. Большое влияние. Серьезная работа, крутая команда, бесконечный рост.
uz: Falco — O‘zbekistonning kelajakdagi yetakchilari birlashadigan joy. Haqiqiy imkoniyatlar. Katta ta'sir. Jiddiy ish, ajoyib jamoa, cheksiz o‘sish.

source: Want in? Apply here.
ru: Хотите присоединиться? Подайте заявку здесь.
uz: Kirishni xohlaysizmi? Bu yerda ariza bering.

source: Notable Spotlights
ru: Значимые достижения
uz: E’tiborli yorqin lahzalar

source: Members of FALCO making an impact in their fields.
ru: Члены FALCO, оказывающие влияние в своих областях.
uz: FALCO a'zolari o‘z sohalarda ta'sir ko‘rsatmoqda.

source: May 16, 2025
ru: 16 мая 2025
uz: 2025-yil 16-may

source: Game Festival 2025
ru: Игровой фестиваль 2025
uz: O‘yinlar festivali 2025

source: On May 16th, our team dove into the world of cutting-edge gaming at GameFest 2025. We experienced top startup pitches that blew our minds with innovation.
ru: 16 мая наша команда погрузилась в мир передовых игр на GameFest 2025. Мы стали свидетелями потрясающих стартап-презентаций, поражающих своим инновационным подходом.
uz: 16-may kuni jamoamiz GameFest 2025 tadbirida zamonaviy o‘yinlar dunyosiga sho‘ng‘idi. Bizni hayratda qoldirgan innovatsion startap taqdimotlarini boshdan kechirdik.

source: View Profile
ru: Посмотреть профиль
uz: Profilni ko‘rish

source: April 30, 2025
ru: 30 апреля 2025
uz: 2025-yil 30-aprel

source: Rektor Cup
ru: Кубок ректора
uz: Rektor kubogi

source: 🏆 1st Place — Automated Drone Racing | Rector’s Cup From concept to execution — we soared. Falco claimed 1st place in the automated drone racing category at the Rector’s Cup, outpacing ...
ru: 🏆 1-е место — Гонки дронов с автоматизацией | Кубок ректора. От концепции до реализации — мы взлетели. Falco занял 1-е место в категории гонок дронов с автоматизацией на Кубке ректора, обойдя ...
uz: 🏆 1-o‘rin — Avtomatlashtirilgan dron poygasi | Rektor kubogi Kontseptsiyadan ijroga — biz yuksaldik. Falco Rektor kubogida avtomatlashtirilgan dron poygasi toifasida 1-o‘rinni egalladi, boshqalarni ortda qoldirib ...

source: May 5, 2025
ru: 5 мая 2025
uz: 2025-yil 5-may

source: CanSat Uzbekistan–2025
ru: CanSat Узбекистан–2025
uz: CanSat O‘zbekiston–2025
