Repository: bobur22/global-tuitUZ
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Suite-style accommodations
ru: Проживание в стиле апартаментов
uz: Suite uslubidagi turar joylar

source: Community lounges and kitchens
ru: Общие гостиные и кухни
uz: Jamoa dam olish xonalari va oshxonalar

source: 24/7 security and support
ru: Круглосуточная охрана и поддержка
uz: 24/7 xavfsizlik va qo‘llab-quvvatlash

source: Dining Facilities
ru: Столовые
uz: Ovqatlanish jihozlari

source: Enjoy access to a variety of dining options across campus, catering to diverse tastes and dietary needs. Conveniently located and designed with student well-being in mind.
ru: Наслаждайтесь доступом к разнообразным вариантам питания на кампусе, учитывающим различные вкусы и диетические потребности. Удобно расположенные и разработанные с учетом благополучия студентов.
uz: Kampus bo‘ylab turli xil ta'mlar va ovqatlanish ehtiyojlariga mos keladigan ovqatlanish variantlariga kirishdan bahramand bo‘ling. Qulay joylashgan va talabalar farovonligi hisobga olinagan holda ishlab chiqilgan.

source: 5 Locations
ru: 5 мест
uz: 5 ta joy

source: Security Services
ru: Службы безопасности
uz: Xavfsizlik xizmatlari

source: Our campus is protected around the clock with professional security staff, surveillance systems, and rapid response protocols to ensure a safe living and learning environment.
ru: Наш кампус защищен круглосуточно профессиональным персоналом охраны, системами видеонаблюдения и протоколами быстрого реагирования, чтобы обеспечить безопасную среду для жизни и обучения.
uz: Bizning kampusimiz professional xavfsizlik xodimlari, kuzatuv tizimlari va tezkor javob protokollari bilan kechayu kunduz himoyalangan bo‘lib, xavfsiz yashash va o‘quv muhitini ta'minlaydi.

source: 24/7 Support
ru: Круглосуточная поддержка
uz: 24/7 qo‘llab-quvvatlash

source: Main Building
ru: Главное здание
uz: Asosiy bino

source: Explore the TUIT Campus
ru: Исследуйте кампус ТУИТ
uz: TUIT kampusini kashf eting

source: At TUIT University, campus life goes beyond the classroom. Our campus is designed to inspire innovation, collaboration, and a vibrant student experience. From quiet study areas to lively event spaces, you'll find everything you need to thrive.
ru: В университете ТУИТ жизнь в кампусе выходит за рамки аудиторий. Наш кампус спроектирован так, чтобы вдохновлять на инновации, сотрудничество и яркий студенческий опыт. От тихих учебных зон до оживленных пространств для мероприятий — вы найдете все, что нужно для процветания.
uz: TUIT Universitetida kampus hayoti sinf xonasidan tashqariga chiqadi. Bizning kampusimiz innovatsiya, hamkorlik va jonli talaba tajribasini ilhomlantirish uchun mo‘ljallangan. Tinim bilmaydigan o‘quv joylaridan jonli tadbir joylarigacha, muvaffaqiyat qozonish uchun kerak bo‘lgan hamma narsani topasiz.

source: Student Life & Community Spaces
ru: Студенческая жизнь и общественные пространства
uz: Talabalar hayoti va jamoa joylari

source: Student Activity Center
ru: Центр студенческой активности
uz: Talaba faoliyati markazi

source: Green spaces and gardens
ru: Зеленые зоны и сады
uz: Yashil maydonlar va bog‘lar

source: Meeting and event venues
ru: Места для встреч и мероприятий
uz: Uchrashuv va tadbir joylari

source: Performance Spaces
ru: Пространства для выступлений
uz: Spektakl joylari

source: Enjoy a range of cultural and creative events at our state-of-the-art performance venues. From student concerts to theater productions, these spaces showcase talent and build community.
ru: Наслаждайтесь разнообразными культурными и творческими мероприятиями в наших современных пространствах для выступлений. От студенческих концертов до театральных постановок — эти пространства демонстрируют таланты и укрепляют сообщество.
uz: Zamonaviy spektakl joylarimizda turli xil madaniy va ijodiy tadbirlardan bahramand bo‘ling. Talaba kontsertlaridan teatr spektakllarigacha, bu joylar iste’dodni namoyish etadi va jamoani mustahkamlaydi.

source: Campus Stores
ru: Кампусные магазины
uz: Kampus do‘konlari

source: Find everything you need right on campus—from textbooks and school supplies to snacks, tech accessories, and university merchandise. Convenient locations to keep your day running smoothly.
ru: Найдите все необходимое прямо на кампусе — от учебников и школьных принадлежностей до закусок, технических аксессуаров и сувениров университета. Удобные места, чтобы ваш день проходил гладко.
uz: Kampusda kerak bo‘lgan hamma narsani toping — darsliklar va maktab jihozlaridan tortib, gazaklar, texnologik aksessuarlar va universitet mahsulotlarigacha. Kunni muammosiz o‘tkazish uchun qulay joylar.

source: Central Library
ru: Центральная библиотека
uz: Markaziy kutubxona

source: Student Center
ru: Студенческий центр
uz: Talaba markazi

source: Dormitories
ru: Общежития
uz: Yotoqxonalar

source: Study Areas
ru: Учебные зоны
uz: O‘quv joylari

source: Campus Map
ru: Карта кампуса
uz: Kampus xaritasi

source: Navigate our expansive campus with ease using our interactive map. Locate buildings, facilities, and services to find your way around.
ru: Легко ориентируйтесь на нашем обширном кампусе с помощью интерактивной карты. Найдите здания, сооружения и сервисы, чтобы легко передвигаться.
uz: Interaktiv xaritamiz yordamida keng kampusimizda osongina harakatlaning. Binolar, jihozlar va xizmatlarni topish uchun yo‘lingizni toping.

source: Academic Buildings
ru: Академические здания
uz: Akademik binolar

source: Athletic Facilities
ru: Спортивные сооружения
uz: Sport jihozlari

source: Parking Areas
ru: Парковочные зоны
uz: Avtoturargohlar

source: Download PDF Map
ru: Скачать карту в PDF
uz: PDF xaritani yuklab oling

source: Student life
ru: Студенческая жизнь
uz: Talabalar hayoti

source: Experience Campus Life
ru: Ощутите жизнь в кампусе
uz: Kampus hayotini his qiling

source: Immerse yourself in vibrant campus life! Discover our dynamic community and create unforgettable memories, fostering growth and unforgettable experiences.
ru: Погрузитесь в яркую жизнь кампуса! Откройте для себя наше динамичное сообщество и создайте незабываемые воспоминания, способствующие росту и уникальному опыту.
uz: Jonli kampus hayotiga sho‘ng‘ing! Dinamik jamoamizni kashf eting va unutilmas xotiralar yarating, o‘sish va unutilmas tajribalarni rivojlantiring!

source: Clubs
ru: Клубы
uz: Klublar

source: 40+ Organizations
ru: 40+ организаций
uz: 40+ tashkilot

source: Athletics
ru: Спорт
uz: Sport

source: 15+ Sports Teams
ru: 15+ спортивных команд
uz: 15+ sport jamoalari

source: Events
ru: Мероприятия
uz: Tadbirlar

source: 200+ Annual Events
ru: 200+ ежегодных мероприятий
uz: 200+ yillik tadbirlar

source: Housing
ru: Жилье
uz: Turar joy

source: 5 Residence Halls
ru: 5 общежитий
uz: 5 ta turar joy zallari

source: Clubs &amp; Organizations
ru: Клубы и организации
uz: Klublar va tashkilotlar

source: Active Clubs
ru: Активные клубы
uz: Faol klublar

source: Join a Community That Shares Your Interests
ru: Присоединяйтесь к сообществу, разделяющему ваши интересы
uz: Qiziqishlaringizni baham ko‘radigan jamoaga qo‘shiling

source: At Tashkent University of Information Technologies, we believe innovation thrives when diverse minds collaborate. Beyond labs and lectures, our student organizations help you grow, network, and recharge.
ru: В Ташкентском университете информационных технологий мы верим, что инновации процветают, когда разные умы сотрудничают. Помимо лабораторий и лекций, наши студенческие организации помогают вам расти, налаживать связи и перезаряжаться.
uz: Toshkent Axborot Texnologiyalari Universitetida biz turli xil aql-idroklar hamkorligida innovatsiya rivojlanadi deb hisoblaymiz. Laboratoriyalar va ma'ruzalardan tashqari, bizning talaba tashkilotlarimiz sizga o‘sish, tarmoq qurish va qayta zaryad qilishda yordam beradi.

source: Tech & Innovation
ru: Технологии и инновации
uz: Texnologiya va innovatsiya

source: 18 Clubs
ru: 18 клубов
uz: 18 ta klub

source: Global Community
ru: Глобальное сообщество
uz: Global jamoa

source: 5 International Groups
ru: 5 международных групп
uz: 5 ta xalqaro guruh

source: Academic Societies
ru: Академические общества
uz: Akademik jamiyatlar

source: 12 Associations
ru: 12 ассоциаций
uz: 12 ta assotsiatsiya

source: Arts & Recreation
ru: Искусство и отдых
uz: San'at va dam olish

source: 6 Creative Outlets
ru: 6 творческих направлений
uz: 6 ta ijodiy yo‘nalish

source: Athletics & Recreation at TUIT
ru: Спорт и отдых в ТУИТ
uz: TUITda sport va dam olish

source: At TUIT University, we believe in building strong minds and bodies. Our athletics and recreation programs offer students the opportunity to stay active, compete, and grow through sports and teamwork. Whether you're aiming for a championship or just staying fit, there's a place for you here.
ru: В университете ТУИТ мы верим в развитие сильных умов и тел. Наши программы по спорту и отдыху предоставляют студентам возможность оставаться активными, соревноваться и расти через спорт и командную работу. Независимо от того, стремитесь ли вы к чемпионству или просто хотите поддерживать форму — здесь вы найдете свое место.
uz: TUIT universitetida biz kuchli aql va jismni tarbiyalashga ishonamiz. Sport va dam olish dasturlarimiz talabalar uchun faol bo‘lish, musobaqalashish va jamoaviy sport orqali rivojlanish imkoniyatini taqdim etadi.

source: Sports Teams
ru: Спортивные команды
uz: Sport jamoalari

source: Championships
ru: Чемпионаты
uz: Chempionatlar

source: Athletes
ru: Спортсмены
uz: Sportchilar

source: Swimming
ru: Плавание
uz: Suzish

source: Volleyball
ru: Волейбол
uz: Voleybol

source: Football
ru: Футбол
uz: Futbol

source: Table Tennis
ru: Настольный теннис
uz: Stol tennisi

source: Chess
ru: Шахматы
uz: Shaxmat

source: A Campus Designed for Tech Innovators
ru: Кампус, созданный для технологических новаторов
uz: Texnologiya innovatorlari uchun mo‘ljallangan kampus

source: Where cutting-edge learning meets student comfort – experience spaces built to inspire your next breakthrough.
ru: Где передовое обучение сочетается с комфортом студентов – испытайте пространства, созданные для вдохновения на следующий прорыв.
uz: Eng zamonaviy o‘quv va talaba qulayligi uchrashadigan joy – keyingi yutuqni ilhomlantirish uchun qurilgan joylarni his qiling.

source: Residence
ru: Общежития
uz: Turar joy

source: dormitories with high-speed WiFi, study lounges & 24/7 security.
ru: общежития с высокоскоростным Wi-Fi, учебными зонами и круглосуточной охраной.
uz: tezkor WiFi, o‘quv dam olish xonalari va 24/7 xavfsizlik bilan yotoqxonalar.

source: Dining:
ru: Питание:
uz: Ovqatlanish:

source: Cafés with coding-friendly zones + late-night snack bars for hackathon crews
ru: Кафе с зонами, удобными для программирования + ночные закусочные для команд хакатонов
uz: Kodlash uchun qulay zonali kafelar + xakaton jamoalari uchun kechki gazak barlari

source: Libraries
ru: Библиотеки
uz: Kutubxonalar

source: Hubs with VR learning stations, silent pods & 250K+ e-resources
ru: Центры с VR-станциями для обучения, тихими кабинками и более 250 тыс. электронных ресурсов
uz: VR o‘quv stansiyalari, jimjit podlar va 250 mingdan ortiq elektron resurslar bilan markazlar

source: Innovation Labs
ru: Инновационные лаборатории
uz: Innovatsiya laboratoriyalari

source: 15 specialized labs (AI, IoT, cybersecurity) open 24/7during project seasons
ru: 15 специализированных лабораторий (ИИ, Интернет вещей, кибербезопасность), открытых 24/7 в период проектных сезонов
uz: 15 ta maxsus laboratoriya (AI, IoT, kiberxavfsizlik) loyiha mavsumlarida 24/7 ochiq

source: Next-Gen Recreation
ru: Отдых нового поколения
uz: Keyingi avlod dam olish

source: Esports arena, drone racing track & wellness center with biometric tracking
ru: Арена для киберспорта, трасса для гонок дронов и оздоровительный центр с биометрическим отслеживанием
uz: E-sport arenasi, dron poygasi yo‘lagi va biometrik kuzatuvli salomatlik markazi

source: Virtual Campus Tour
ru: Виртуальный тур по кампусу
uz: Virtual kampus sayohati

source: Life on Campus
ru: Жизнь в кампусе
uz: Kampusdagi hayot

source: Take a glimpse into our vibrant student community
ru: Взгляните на наше яркое студенческое сообщество
uz: Jonli talaba jamoamizga bir nazar tashlang

source: Campus Events
ru: Мероприятия кампуса
uz: Kampus tadbirlari

source: Sport Clubs
ru: Спортивные клубы
uz: Sport klublari

source: Graduation Day
ru: День выпуска
uz: Bitiruv kuni

source: Study Trips
ru: Учебные поездки
uz: O‘quv sayohatlar

source: Your Journey Starts Here
ru: Ваше путешествие начинается здесь
uz: Sizning sayohatingiz shu yerdan boshlanadi

source: At Tashkent University of Information Technologies, we’re building the next generation of IT leaders. Whether you’re passionate about AI, cybersecurity, or software engineering, TUIT provides the tools, mentors, and opportunities to turn your potential into expertise.
ru: В Ташкентском университете информационных технологий мы готовим следующее поколение ИТ-лидеров. Будь вы увлечены ИИ, кибербезопасностью или разработкой программного обеспечения, ТУИТ предоставляет инструменты, наставников и возможности, чтобы превратить ваш потенциал в экспертизу.
uz: Toshkent Axborot Texnologiyalari Universitetida biz keyingi avlod AKT yetakchilarini shakllantirmoqdamiz. Sun'iy intellekt, kiberxavfsizlik yoki dasturiy ta'minot muhandisligiga ishtiyoqmand bo‘lsangiz, TUIT sizning salohiyatingizni tajribaga aylantirish uchun vositalar, murabbiylar va imkoniyatlarni taqdim etadi.

source: Apply Now
ru: Подать заявку сейчас
uz: Hozir ariza bering

source: Messages
ru: Сообщения
uz: Xabarlar

source: Site Maps
ru: Карты сайта
uz: Sayt xaritalari

source: Static Files
ru: Статические файлы
uz: Statik fayllar

source: Syndication
ru: Синдикация
uz: Sindikatsiya

source: That page number is not an integer
ru: Этот номер страницы не является целым числом
uz: Bu sahifa raqami butun son emas

source: That page number is less than 1
ru: Этот номер страницы меньше 1
uz: Bu sahifa raqami 1 dan kichik

source: That page contains no results
ru: Эта страница не содержит результатов
uz: Bu sahifada hech qanday natija yo‘q

source: Enter a valid value.
ru: Введите корректное значение.
uz: To‘g‘ri qiymatni kiriting.

source: Enter a valid domain name.
ru: Введите корректное доменное имя.
uz: To‘g‘ri domen nomini kiriting.

source: Enter a valid URL.
ru: Введите корректный URL.
uz: To‘g‘ri URL manzilini kiriting.

source: Enter a valid integer.
ru: Введите корректное целое число.
uz: To‘g‘ri butun sonni kiriting.

source: Enter a valid email address.
ru: Введите корректный адрес электронной почты.
uz: To‘g‘ri elektron pochta manzilini kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ru: Введите корректный «slug», состоящий из латинских букв, цифр, подчеркиваний или дефисов.
uz: Harflar, raqamlar, pastki chiziqlar yoki defislerden iborat to‘g‘ri “slug” kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ru: Введите корректный «slug», состоящий из букв Unicode, цифр, подчеркиваний или дефисов.
uz: Unicode harflari, raqamlar, pastki chiziqlar yoki defislerden iborat to‘g‘ri “slug” kiriting.

source: Enter a valid %(protocol)s address.
ru: Введите корректный адрес %(protocol)s.
uz: To‘g‘ri %(protocol)s manzilini kiriting.

source: IPv4 or IPv6
ru: IPv4 или IPv6
uz: IPv4 yoki IPv6

source: Enter only digits separated by commas.
ru: Введите только цифры, разделенные запятыми.
uz: Faqat vergul bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ru: Убедитесь, что это значение равно %(limit_value)s (сейчас оно %(show_value)s).
uz: Bu qiymat %(limit_value)s bo‘lishini ta'minlang (hozir %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
ru: Убедитесь, что это значение меньше или равно %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan kichik yoki teng bo‘lishini ta'minlang.

source: Ensure this value is greater than or equal to %(limit_value)s.
ru: Убедитесь, что это значение больше или равно %(limit_value)s.
uz: Bu qiymat %(limit_value)s dan katta yoki teng bo‘lishini ta'minlang.

source: Ensure this value is a multiple of step size %(limit_value)s.
ru: Убедитесь, что это значение кратно шагу %(limit_value)s.
uz: Bu qiymat %(limit_value)s qadam hajmining ko‘paytmasi bo‘lishini ta'minlang.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ru: Убедитесь, что это значение кратно шагу %(limit_value)s, начиная с %(offset)s, например, %(offset)s, %(valid_value1)s, %(valid_value2)s и так далее.
uz: Bu qiymat %(offset)s dan boshlab %(limit_value)s qadam hajmining ko‘paytmasi bo‘lishini ta'minlang, masalan, %(offset)s, %(valid_value1)s, %(valid_value2)s va hokazo.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ru: Убедитесь, что это значение содержит не менее %(limit_value)d символа (сейчас %(show_value)d).
uz: Bu qiymat kamida %(limit_value)d ta belgidan iborat bo‘lishini ta'minlang (hozir %(show_value)d ta).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ru: Убедитесь, что это значение содержит не более %(limit_value)d символа (сейчас %(show_value)d).
uz: Bu qiymat ko‘pi bilan %(limit_value)d ta belgidan iborat bo‘lishini ta'minlang (hozir %(show_value)d ta).

source: Enter a number.
ru: Введите число.
uz: Raqam kiriting.

source: Ensure that there are no more than %(max)s digit in total.
ru: Убедитесь, что общее количество цифр не превышает %(max)s.
uz: Jami %(max)s ta raqamdan ko‘p bo‘lmasligini ta'minlang.

source: Ensure that there are no more than %(max)s decimal place.
uz: Ko‘pi bilan %(max)s ta kasr joy bo‘lmasligini ta'minlang.

source: Ensure that there are no more than %(max)s digit before the decimal point.
uz: Kasrdan oldin ko‘pi bilan %(max)s ta raqam bo‘lmasligini ta'minlang.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
uz: Fayl kengaytmasi “%(extension)s” ruxsat etilmagan. Ruxsat etilgan kengaytmalar: %(allowed_extensions)s.

source: Null characters are not allowed.
uz: Null belgilari ruxsat etilmaydi.

source: and
uz: va

source: %(model_name)s with this %(field_labels)s already exists.
uz: Bu %(field_labels)s bilan %(model_name)s allaqachon mavjud.

source: Constraint “%(name)s” is violated.
uz: “%(name)s” cheklovi buzilgan.

source: Value %(value)r is not a valid choice.
uz: %(value)r qiymati to‘g‘ri tanlov emas.

source: This field cannot be null.
uz: Bu maydon null bo‘lishi mumkin emas.

source: This field cannot be blank.
uz: Bu maydon bo‘sh bo‘lishi mumkin emas.

source: %(model_name)s with this %(field_label)s already exists.
uz: Bu %(field_label)s bilan %(model_name)s allaqachon mavjud.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
uz: %(field_label)s %(date_field_label)s %(lookup_type)s uchun yagona bo‘lishi kerak.

source: Field of type: %(field_type)s
uz: Maydon turi: %(field_type)s

source: “%(value)s” value must be either True or False.
uz: “%(value)s” qiymati faqat True yoki False bo‘lishi kerak.

source: “%(value)s” value must be either True, False, or None.
uz: “%(value)s” qiymati faqat True, False yoki None bo‘lishi kerak.

source: Boolean (Either True or False)
uz: Mantiqiy (Yo True, yo False)

source: String (up to %(max_length)s)
uz: Satr (ko‘pi bilan %(max_length)s)

source: String (unlimited)
uz: Satr (cheklanmagan)

source: Comma-separated integers
uz: Vergul bilan ajratilgan butun sonlar

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
uz: “%(value)s” qiymati noto‘g‘ri sana formatiga ega. U YYYY-MM-DD formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
uz: “%(value)s” qiymati to‘g‘ri formatga ega (YYYY-MM-DD), lekin bu noto‘g‘ri sana.

source: Date (without time)
uz: Sana (vaqtsiz)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
uz: “%(value)s” qiymati noto‘g‘ri formatga ega. U YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
uz: “%(value)s” qiymati to‘g‘ri formatga ega (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]), lekin bu noto‘g‘ri sana/vaqt.

source: Date (with time)
uz: Sana (vaqt bilan)

source: “%(value)s” value must be a decimal number.
uz: “%(value)s” qiymati o‘nlik son bo‘lishi kerak.

source: Decimal number
uz: O‘nlik son

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
uz: “%(value)s” qiymati noto‘g‘ri formatga ega. U [DD] [[HH:]MM:]ss[.uuuuuu] formatida bo‘lishi kerak.

source: Email address
uz: Elektron pochta manzili

source: File path
uz: Fayl yo‘li

source: “%(value)s” value must be a float.
uz: “%(value)s” qiymati suzuvchi nuqta soni bo‘lishi kerak.

source: Floating point number
uz: Suzuvchi nuqta soni

source: “%(value)s” value must be an integer.
uz: “%(value)s” qiymati butun son bo‘lishi kerak.

source: Integer
uz: Butun son

source: Big (8 byte) integer
uz: Katta (8 bayt) butun son

source: Small integer
uz: Kichik butun son

source: IPv4 address
uz: IPv4 manzili

source: IP address
uz: IP manzili

source: “%(value)s” value must be either None, True or False.
uz: “%(value)s” qiymati faqat None, True yoki False bo‘lishi kerak.

source: Boolean (Either True, False or None)
uz: Mantiqiy (Yo True, yo False, yo None)

source: Positive big integer
uz: Musbat katta butun son

source: Positive integer
uz: Musbat butun son

source: Positive small integer
uz: Musbat kichik butun son

source: Slug (up to %(max_length)s)
uz: Slug (ko‘pi bilan %(max_length)s)

source: Text
uz: Matn

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
uz: “%(value)s” qiymati noto‘g‘ri formatga ega. U HH:MM[:ss[.uuuuuu]] formatida bo‘lishi kerak.

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
uz: “%(value)s” qiymati to‘g‘ri formatga ega (HH:MM[:ss[.uuuuuu]]), lekin bu noto‘g‘ri vaqt.

source: Time
uz: Vaqt

source: Raw binary data
uz: Xom ikkilik ma'lumotlar

source: “%(value)s” is not a valid UUID.
uz: “%(value)s” to‘g‘ri UUID emas.

source: Universally unique identifier
uz: Umumjahon yagona identifikator

source: File
uz: Fayl

source: Image
uz: Rasm

source: A JSON object
uz: JSON obyekti

source: Value must be valid JSON.
uz: Qiymat to‘g‘ri JSON bo‘lishi kerak.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
uz: %(field)s %(value)r bilan %(model)s namunasi to‘g‘ri tanlov emas.

source: Foreign Key (type determined by related field)
uz: Tashqi kalit (tegishli maydon tomonidan aniqlangan tur)

source: One-to-one relationship
uz: Birga-bir munosabat

source: %(from)s-%(to)s relationship
uz: %(from)s-%(to)s munosabati

source: %(from)s-%(to)s relationships
uz: %(from)s-%(to)s munosabatlari

source: Many-to-many relationship
uz: Ko‘pga-ko‘p munosabat

source: This field is required.
uz: Bu maydon talab qilinadi.

source: Enter a whole number.
uz: Butun sonni kiriting.

source: Enter a valid date.
uz: To‘g‘ri sanani kiriting.

source: Enter a valid time.
uz: To‘g‘ri vaqtni kiriting.

source: Enter a valid date/time.
uz: To‘g‘ri sana/vaqtni kiriting.

source: Enter a valid duration.
uz: To‘g‘ri davomiylikni kiriting.

source: The number of days must be between {min_days} and {max_days}.
uz: Kunlar soni {min_days} va {max_days} orasida bo‘lishi kerak.

source: No file was submitted. Check the encoding type on the form.
uz: Hech qanday fayl topshirilmadi. Shakldagi kodlash turini tekshiring.
